[
  {
    "path": "posts/2021-06-20-dataviz-makeover-02/",
    "title": "DataViz Makeover 02 ",
    "description": "The task for this makeover is to propose  **interactive visualisation** for the infographics by Department of Statistics, Singapore (DOS). The details can be found [here](https://isss608.netlify.app/dataviz/dataviz2).",
    "author": [
      {
        "name": "Archie Dolit",
        "url": "https://www.linkedin.com/in/adolit/"
      }
    ],
    "date": "2021-06-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Data Visualisation\r\n4.0 Step-by-step Guide\r\n4.1 Data Understanding\r\n4.2 Data Preparation\r\n4.3 Data Visualisation\r\n\r\n5.0 Derived Insights\r\n5.1 Trading Region\r\n5.2 Top Trading Partners by Total Trade\r\n5.3 Top Net Exporter and Top Net Importer\r\n\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below:\r\n\r\nGenerally, the graph is beautiful but confusing. The use of bubble size to indicate the total merchandise trade is a good initial step. Nonetheless, there are plenty of areas to improve with regards to clarity and aesthetics of the graph as discussed below:\r\n1.1 Clarity\r\nTitle: The title of the graph is vague. It mentions ‘Merchandise Trade Performance with Major Trading Partners’. However, there are no qualifiers for the ‘Performance’ and ‘Major’ - does ‘performance’ mean total trade (import + export) and ‘major’ mean Top 10 trading partners?\r\nAxis: The position of countries as net exporter or net importer is confusing. In particular, it is difficult to determine the centre point (white circle) for the bubbles of Malaysia, EU, Japan Republic of Korea - whether they are within the net importer blue region or net exporter green region. Additionally, the diagonal separation of net importer region and net exporter region is not intuitive.\r\nProportionality: The total trade per trading partner is not geographically proportional. European Union comprises of several countries namely Austria, Belgium, Bulgaria, Croatia, Cyprus, Czech Rep, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Ireland, Italy, Latvia, Lithuania, Luxembourg, Malta, Netherlands, Poland, Portugal, Romania, Slovak Rep, Slovenia, Spain, and Sweden while Hong Kong is special administrative region of Mainland China. These trading partners are then compared against individual countries.\r\nVisibility: The size and color of bigger bubbles obstruct the view of other smaller bubbles. For example, United States blocks the bubble of EU and Malaysia while Japan blocks the bubble of Republic of Korea.\r\nInteractivity: Aside from zooming effect of bubbles, no additional information is provided when the mouse is hovering the country.\r\n1.2 Aesthetic\r\nColor: The use of different colors for each trading partner does not provide additional information and can cause misinterpretation. For example, the green color of Malaysia bubble may be associated with net exporter green region which is not the case – looking at the centre point of Malaysia, it is positioned towards net importer region. Additionally, the use of solid color (opacity = 100%) blocks the information of smaller bubble size.\r\nLegend: The note at the bottom of the graph which serves as a legend is too wordy. It is not easy to understand how the color of the background is associated with net import and net export regions.\r\nAxis: Both the x and y axes for net exporters and net importers do not include the unit of measurement which should be in billion Singapore dollars (S$0 to S$ 80B).\r\nSubtitle. The graph does not have subtitle which can be used to convey intent and additional information. It also does not include annotations to tell interesting data stories.\r\n2.0 Alternative Design\r\nThe proposed alternative design leverages on the good qualities of the original visualisation. It keeps bubble graph corresponding to the total merchandise trade value, green color for net exporter and blue color for net importers. Additionally, the design will preserve the ‘ Top 10 Major Trading Partners’ but present it in another way using slopegraph.\r\n\r\nWith reference to the critiques previously mentioned, the following suggestions are proposed:\r\n2.1 Clarity\r\nTitle: The title of the graph is updated to SINGAPORE’S INTERNATIONAL TRADE FROM ALL REGIONS, 2011-2020 to showcase the scope of visualization both in number years and trading partners included.\r\nAxis: The position of trading partners will be plot against a quadrant where x-axis is the percentile of total trade and y-axis is the percentile of trade balance. The 4 quadrants can clearly show which countries are among the top exporter, top importers and biggest trading partners in terms of total trade.\r\nProportionality: The visualization of trade will be done on individual trading partners instead of regional block (example: European Union). Nevertheless, an additional filter is added to select countries from certain regions (example: Africa, Americas, Asia, Europe, Ocenia).\r\nVisibility: Opacity is set to 80% and border is added to prevent bigger bubbles from blocking the smaller bubbles.\r\nInteractivity: Interactivity is enhanced using filters to control the information shown on the quadrant and slopegraph. For the quadrant, users can select how many trading partners, from which region and what year will be shown in the animated bubble plot. For the slopegraph, users can select the start and end year and see how the Top 10 trading partners change over the period. To show the trade details of a particular country, user can click on any country from quadrant or slopegraph. Afterwards, export, import and trade balance will be plotted from 2011-2020. Additional information is shown when hovering the trading partner names including the ranks, total trade, trade balance, export, import and effective date\r\nAnimation: Animation is added to effectively show the transitions or changes in ranks, size and distribution of different trading partners.\r\n2.2 Aesthetic\r\nColor: The color is updated to correspond to the trade balance. Blue is use for net importers while green is used for net exporters. This color scheme is consistent with the original visualisation where net importers and net exporters are marked by green and blue regions respectively. Additionally, the size of bubbles for quadrant and thickness of the line for slopegraph corresponds to the total trade of each trading partners.\r\nLegend: The color legend is added beside the subtitle so user can read it quickly and have an idea what the 2 colors mean.\r\nAxis: The axis is updated to percentile of total trade and percentile of trade balance for quadrant analysis. For both slopegraph and trade details, the x-axis is set to trading date.\r\nSubtitle. Subtitle is added to convey additional information. Data source is also included to cite Department of Statistics, Singapore.\r\nLayout. The layout utilizes the coordinate views for linked and multi-dimensional exploration. Users can start with the overview explorations of quadrant analysis by changing the number of trading partners shown, region and year of interest. The animation from quadrant may not explicitly show the ranking of trading partners, the slopegraph can supplement how the top trading partners change over the years. The user can also perform detailed exploration by selecting the name of trading partner from quadrant and slopegraph graphs.\r\n3.0 Proposed Data Visualisation\r\nThe proposed data visualisation can be seen below and available on Tableau Public through this link.\r\n\r\n4.0 Step-by-step Guide\r\n4.1 Data Understanding\r\nThe data is available from Merchandise Trade by Region/Market and can be downloaded by clicking on the link ‘Download all in Excel’ on the same webpage. The file (outputFile.xlsx) consists of 3 sheets - Content, T1 which contains merchandise imports, and T2 which contains merchandise exports. The document includes merchandise trade information for more than one hundred countries and regions starting from Jan 1976 up to the present.\r\n\r\nFor this makeover, all trading partners will be included except for the aggregate value of different regions (America, Asia, Europe, Oceania, Africa and European Union) will be excluded to maintain the same geographical proportional. Additionally, the visualisation is limited to the period of Jan 2011 to Dec 2020.\r\n4.2 Data Preparation\r\n#\r\nStep\r\nReference Image\r\nP1\r\nDownload the file from SingStat website, unzip it, connect the Excel file (outputFile.xlsx) to Tableau Prep Builder and select “Cleaned with Data Interpreter”\r\n\r\nP2\r\nDrag T1 to the main pane, select rows corresponding to the Variables, 2011, 2012, 2013 until 2020 using the search function\r\n\r\nP3\r\nAdd “Clean” step, Filter: Selected Values, search for “Total”, “Million” and exclude these rows\r\n\r\nP4\r\nSelect Variables column, click on the “Automatic Split”\r\n\r\nP5\r\nDelete Variables – Split 2 and Variables\r\n\r\nP6\r\nAdd a “Pivot” step and drag Jan 2011 to Dec 2020 to the Pivoted Fields\r\n\r\nP7\r\nRename “Pivot 1 Names” to “Date”, “Pivot1 Values” to “Import Raw” and “Variables – Split 1” to “Trading Partner\r\n\r\nP8\r\nRepeat the same steps P2 to P7 for the T2 sheet. However, in P7, rename “Pivot1 Values” to “Export Raw”\r\n\r\nP9\r\nDrag Pivot 2 towards Pivot 1 and create a Join step with settings Pivot 1 Trading Partner = Pivot 2 Trading Partner and Pivot 1 Date = Pivot 2 Date\r\n\r\nP10\r\nClick on the blue shaded region to investigate the cause of the mismatch.\r\nBased on initial analysis, there are 3,360 entries from the T1 (merchandise imports) which cannot be matched in T2 (merchandise exports). For certain trading months, Singapore is importing from these 28 trading partners but not exporting at the same time which can lead to trade balance deficit.\r\nP11\r\nCreate a “Export” calculated field by multiplying “Export Raw” by 1000. Similarly, create “Import” calculated field by multiplying “Export Raw” by 1000\r\n\r\nP12\r\nFrom the Join Results, remove the fields “Date – 1”, “Trading Partner – 1”, “Export Raw” and “Import Raw”\r\n\r\nP13\r\nDownload the “continents2.csv” from Kaggle website to map the trading partners (countries) to region (continent)\r\n\r\nP14\r\nConnect “continents2.csv” to Tableau Prep Builder and drag continents2 toward Join1 and create Join 2 with settings Join 1 Trading Partner = Join 2 name\r\n\r\nP15\r\nInvestigate the cause of the mismatch and update the continents2 name to match the Join 1 Trading Partner\r\nDuring the data clean up, “Yemen Democratic” and “Germany, Democratic Republic” of were excluded since these are old country names are no trades from 2011 to 2020. “Commonwealth of Independent States” was mapped to “Armenia”; “Other Countries in America” was mapped to “Antigua and Barbuda” and “Other Countries in Ocenia” was mapped to “American Samoa”.\r\nP16\r\nFrom the Join Results, remove other fields from continent2 except for “region” and “sub-region”\r\n\r\nP17\r\nAdd Output node and save the file as tidy_trade_data_makeover2.hyper\r\n\r\n4.3 Data Visualisation\r\n#\r\nStep\r\nReference Image\r\nV1\r\nConnect tidy_trade_data_makeover2 Extract to Tableau Desktop\r\n\r\nV2\r\nCreate “Net Trade” calculated field by getting the difference of “Export” and “Import”.\r\n\r\nV3\r\nCreate “Total Trade” calculated field by getting the sum of “Export” and “Import”.\r\n\r\nV4\r\nDrag “Total Trade” to Columns, “Net Trade” to Rows and set “Trading Partners” to Details and “Net Trade” to Color in the Marks Pane.\r\n\r\nV5\r\nChange the “Total Trade” and “Net Trade” settings to Quick Table Calculation -> Percentile\r\n\r\nV6\r\nUpdate the calculation to Compute Using -> “Trading Partners”.\r\n\r\nV7\r\nAdjust the color opacity to 80% and negative value to blue and positive to green.\r\n\r\nV8\r\nDrag “Total Trade” to Size and set the Graph to “Circle”\r\n\r\nV9\r\nCreate 6 new calculated fields namely:1) Net Exporter 2) Net Importer 3) Net Trade Label  4) Rank by Net Exporter  5) Rank by Net Importer 6) Rank by Total Trade The formulas are shown on the reference figures.\r\n\r\nV10\r\nDrag the 6 new calculated fields to the Tooltip of the Marks pane\r\n\r\nV11\r\nAdjust the Tooltip to highlight name, total trade, net trade and ranks as shown on the reference figure.\r\n\r\nV12\r\nAdd a 50% percentile reference line with dash line format on both x and y axes\r\n\r\nV13\r\nDrag the “Date” to Filters pane, Show Filter and set to Discrete.\r\n\r\nV14\r\nAdjust the YEAR(DATE) filter and uncheck “Show All Value” and set to “Single Value (list)”.\r\n\r\nV15\r\nDrag “Region” to Filters pane, Show Filter and adjust to “Single Value (list).\r\n\r\nV16\r\nDrag “Rank by Total Trade” to Filters pane, Show Filter and adjust to “Range of values”.\r\n\r\nV17\r\nDrag “Trading Partners” to “Label” and adjust the font size to 7 and alignment to Bottom\r\n\r\nV18\r\nEnable the animation by selecting Format -> Animations. Set the Duration to 1.5 seconds and Style to Sequential.\r\n\r\nV19\r\nEdit the title as shown in the reference image and save the sheet as Bubble Plot.\r\n\r\nV20\r\nIn a new sheet, drag “Date” to Columns, “Net Trade” and “Total Trade” to Rows and set to “Dual Axis”.\r\n\r\nV21\r\nFor SUM(Net Trade) in the Marks pane, set the graph to Bar chart.\r\n\r\nV22\r\nAdjust the color and set negative value to blue and positive to green.\r\n\r\nV23\r\nFor SUM(Total Trade) in the Marks pane, set the graph to Line chart.\r\n\r\nV24\r\nAdjust the y-axis of Total Trade to gold to match the color of the line chart.\r\n\r\nV25\r\nRotate the x-axis label and adjust the size of the graph to make it as small as possible while maintaining the details. Save the sheet as Annual Bar and Line.\r\n\r\nV26\r\nIn the Bubble Plot Tooltip, insert the Annual Bar and Line.\r\n\r\nV27\r\nIn a new sheet, drag “Date” to Columns and set to “Month” and “Continuous”.\r\n\r\nV28\r\nDrag “Export” and “Import” to Rows and set to “Dual Axis”.\r\n\r\nV29\r\nDrag “Net Trade” two times to Rows and set to “Dual Axis”.\r\n\r\nV30\r\nSynchronize the y-axis of “Import” and uncheck the “Show Header” to hide the second y-axis.\r\n\r\nV31\r\nIn the Marks pane, change the SUM(Export) and SUM(Import) to “Area” chart. Additionally, set the first SUM(Net Trade) to “Bar” and the second to “Line”.\r\n\r\nV32\r\nAdjust the color of the SUM(EXPORT) to green and SUM(IMPORT) to blue with white Border and 70% opacity.\r\n\r\nV33\r\nAdjust the color of both SUM(Net Trade) and set negative value to blue and positive to green with 80% opacity.\r\n\r\nV34\r\nDrag “Trading Partner”, “Export” and “Import” into the SUM(Export) and SUM(Import) tooltips.\r\n\r\nV35\r\nAdjust the SUM(Export) and SUM(Import) tooltips to highlight the date, name, export and import of the trading partner as shown by the reference image.\r\n\r\nV36\r\nDrag “Trading Partner”, “Net Trade Label”, “Net Exporter”, “Net Importer”, “Total Trade” into the SUM(Net Trade) tooltips.\r\n\r\nV37\r\nAdjust the SUM(Net Trade) tooltip to highlight the date, name, net export, net import and total trade of the trading partner as shown by the reference image.\r\n\r\nV38\r\nEdit the title as shown in the reference image and save the sheet as Monthly Bar.\r\n\r\nV39\r\nIn a new sheet, drag “Date” to Columns and “Total Trade” to Rows.\r\n\r\nV40\r\nCreate a new calculated field “Total Trade End Point” as shown in the reference image.\r\n\r\nV41\r\nIn the Marks pane, adjust the graph to line. Drag “Trading Partner” to “Details” and “Label” with Label start of line and Label end of line enabled.\r\n\r\nV42\r\nDrag “Date” to Filters, Show Filter and uncheck “Show All Value” and set to “Multiple Value (list)”.\r\n\r\nV43\r\nDrag “Total Trade End Point” to Filters\r\n\r\nV44\r\nDrag “Rank by Total Trade” to Filters and set Range to values to 1 to 10.\r\n\r\nV45\r\nDrag Net Trade to Color and Adjust the color opacity to 95% and negative value to blue and positive to green.\r\n\r\nV46\r\nDrag “Total Trade” to Size and adjust to middle mark as shown in the reference image\r\n\r\nV47\r\nDrag “Net Trade Label”, “Net Exporter”, “Net Importer”, “Rank by Total Trade” into the Tooltip.\r\n\r\nV48\r\nAdjust the tooltip to highlight the date, name, net export, net import and total trade of the trading partner as shown by the reference image.\r\n\r\nV49\r\nHide the y-axis label by unchecking the “Show Header” and formatting the Columns line to “None”\r\n\r\nV50\r\nEdit the title as shown in the reference image and save the sheet as Slopegraph.\r\n\r\nV51\r\nFor the Bubble Pot, Monthly Bar, and Slopegraph, set the view to “Entire View”\r\n\r\nV52\r\nCreate a new dashboard, set the size to “Automatic” and follow the layout of the proposed design.\r\n\r\nV53\r\nUpdate the filter labels as follows: - “Select # of Partners” from the “Rank by Total Trade” - “Select Region” from “Region” - “Select Trade Year” from “YEAR(Date)” - “Select Start & End Year to Compare” from “YEAR(Date) Unused filters will be removed from the dashboard.\r\n\r\nV54\r\nIn the Dashboard menu, select Action and Add “Filter Action” action as shown in the reference image and save it as “Selected Trading Partner”\r\n\r\nV55\r\nFinally, add title, subtitle, annotation in the animated bubble plot, write up and data source reference hyperlinks.\r\n\r\n5.0 Derived Insights\r\n5.1 Trading Region\r\nFor the year 2020, Asia is the top trading region of Singapore accounting to 37 out of 109 trading partners, followed by Europe with 27 trading partners, Americas with 26 trading partners, Oceania with 17 trading partners and lastly Africa with only 2 trading partners.\r\nThe 2 trading partners in Africa are French Southern Territories and South Sudan. Even with these 2 partners, the trade is NOT consistent. For example, South Sudan has import of S$0.25M around April and May 2014 which was only followed by another import of S$1.443M in Jan 2020.\r\n\r\nFor the Singapore government and companies, it means that there is a huge growth potential in this region, both in terms of import and export, since the little red dot is barely present in the massive African continent.\r\n5.2 Top Trading Partners by Total Trade\r\nFor 2011 to 2020, the Top 10 trading partners is largely unchanged with Malaysia, Mainland China, Indonesia, United States, Hong Kong, Japan, Taiwan, Republic of Korea and Thailand maintaining their top ranks for over a decade.\r\n\r\nFor 2011, the annual total trade of Malaysia is S$ 113.347B which rank 1. However, it slides to rank 2 in 2020 with lower total trade value of S$103.450B. Malaysia also transitioned from net exporter in 2011 with a net export of 14.863B to net importer in 2020 with net import of S$11.649B.\r\n\r\nOn the other hand, Mainland China rose both in ranking and total trade capturing the top spot in 2020 with a total trade of S$136.204B up from its runner up position in 2011 with only S$101.748B total trade.\r\n\r\n5.3 Top Net Exporter and Top Net Importer\r\nIn 2020, Taiwan is the top net importer with S$24.932B net import. Looking back in 2011, Taiwan only ranked no. 7 with net import of S$8.988B.\r\n\r\nThe top importer in 2011 is Saudi Arabia with net import of $S21.063B.\r\n\r\nThroughout the decade, Hong Kong has consistently maintained its top net exporter position with S$52.509B net export in 2011 and S$58.5B net export in 2020.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-06-20-dataviz-makeover-02/img/03_dashboard.png",
    "last_modified": "2021-06-21T11:34:07+08:00",
    "input_file": {},
    "preview_width": 2349,
    "preview_height": 1264
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-01/",
    "title": "DataViz Makeover 01",
    "description": "The task for this makeover is to propose alternative data visualisation for the Merchandise Trade by Region/Market data provided by Department of Statistics, Singapore (DOS). The details can be found [here](https://isss608.netlify.app/dataviz/dataviz1).\n\nThrough this data visualisation makeover, the principles of graphic design particularly the rules for encoding the values in graph, practical guides for using color in charts, and data-ink were applied; while hopefully preventing junk charts. Additionally, data understanding, graphical integrity, and data story annotations were also put into practice.",
    "author": [
      {
        "name": "Archie Dolit",
        "url": "https://www.linkedin.com/in/adolit/"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1.0 Critique of Visualisation\r\n1.1 Clarity\r\n1.2 Aesthetic\r\n\r\n2.0 Alternative Design\r\n2.1 Clarity\r\n2.2 Aesthetic\r\n\r\n3.0 Proposed Data Visualisation\r\n4.0 Step-by-step Guide\r\n4.1 Data Understanding\r\n4.2 Data Preparation\r\n4.3 Data Visualisation\r\n\r\n5.0 Derived Insights\r\n5.1 Total Trade Trends\r\n5.2 Net Trade Insights\r\n5.3 Significant Events\r\n\r\n\r\n1.0 Critique of Visualisation\r\nThe original visualisation can be seen below:\r\n\r\nGenerally, the graph is beautiful but confusing. It has a good and consistent color scheme. The use of trellis display with time-series data conveys the intent of the graph.\r\nNonetheless, there are plenty of areas to improve with regards to clarity and aesthetics of the graph as discussed below:\r\n1.1 Clarity\r\nThe title of the graph is not accurate. In terms of total trade (import + export) for 2019-2020 according to the Merchandise Trade by Region/Market, Indonesia should be included in the ‘Top Six Trading Countries’ while Japan should be excluded. Nevertheless, for total merchandise imports, Japan is ranked 5th while for total merchandise exports, it is ranked 6th.\r\nThe date of the graph is not consistent. The title indicates that is for the year 2019-2020. However, the date for individual graphs shows the year 2019-2021 while the date for Japan only shows 2020.\r\nThe different y-axis scales for the Export and Import can cause misinterpretation. For example, China seems to have higher Import compared to export as shown in the area chart. However, upon examining the 2 y-axes, Export has a range 0 to 8M while Import has a range of 0 to 6M which means that export is generally higher than import.\r\nThe different y-axis scale makes it difficult to compare the trade values across countries. Visually, it seems that Japan has higher trade values compared to others. However, Japan y-axis scales has a range of 0-2M which is significantly lower than Mainland China with range of 0-8M and US with range of 0-6M.\r\nGraphical integrity needs to be improved. The y-axis should be in billion instead of million since the data source indicates “(Thousand Dollars)” so the raw trade values need to be multiplied by 1000.\r\n1.2 Aesthetic\r\nThe graph does not have subtitle which can be used to convey intent and additional information. It also does not indicate the data source.\r\nThe area charts hide the export and import information and make it difficult to interpret the graph. Additionally, the area charts render 3 colors instead of 2, probably because of adjusted opacity percentage. The third color is when the export and import overlap which again can cause misunderstanding.\r\nThe name of the country is not center aligned. The Import secondary y-axis is also too close to the name of the country heading.\r\nThe x-axis title is not consistent with the label. The x-axis indicates ‘Month of Period’ but shows the year 2019, 2020 and 2021. Additionally, there are no tick marks which can represent the months.\r\nThe trellis display of each country is not rendered equally and evenly. Japan looks too narrow while Mainland China and Malaysia are a bit wider.\r\nThe legend title ‘Measure Names’ is not intuitive. The graph does not include annotations to tell interesting data stories.\r\n2.0 Alternative Design\r\nThe proposed alternative design leverages on the good qualities of the original visualisation. It keeps trellis display with time-series data for each county.\r\n\r\nWith reference to the critiques previously mentioned, the following suggestions are proposed:\r\n2.1 Clarity\r\nThe title of the graph is updated to ‘Singapore’s International Trade with Top Trading Partners, 2019-2020’ to make it more consistent with SingStat infographics. Subtitle is added to explain that Japan ranked 5th for imports and 6th for exports.\r\nThe date of observation period on the x-axis is set to Jan 2019 to Dec 2020 to make it coherent with the title. The x-axis title is also removed since the labels obviously indicate trading dates.\r\nTo apply the rules for encoding values in graph, line charts are used to display the time-series data. The line charts for Export and Import used the same scale to make it easier to interpret the data. Total Trade line chart is also added to show the total merchandise trade while Net Trade bar chart is included to show the difference of Export and Import.\r\nThe same y-axis scale is used across different countries. All countries are placed on a single row instead of multiple rows, so it is easier to compare the trade values.\r\nThe y-axis is set to 0-14B to correctly represent the actual trade values.\r\n2.2 Aesthetic\r\nSubtitle is added to convey additional information. Data source is also included to cite Department of Statistics, Singapore.\r\nLine charts were used instead of area charts to easily illustrate the trade values. Green color is used for Export, red for Import and blue for Total Trade. This color scheme is chosen because it adheres to the practical guides of using color in charts and consistent with the graph from the media release of Enterprise Singapore.\r\nThe name of the country is center aligned. The legends were placed on the right side and were not too close to the country heading.\r\nThe x-axis labels were updated to be consistent with the graph title. Tick marks were also added to represent the month.\r\nThe trellis display of each country has even spacing and are consistent both for the line and bar charts. Additionally, the countries are arranged in ascending order by Total Trade with linear trend line.\r\nThe legend title is updated to ‘Trade Types’. Text annotations are added to tell interesting data stories and insights.\r\n3.0 Proposed Data Visualisation\r\nThe proposed data visualisation can be seen below and available on Tableau Public through this link.\r\n\r\n4.0 Step-by-step Guide\r\n4.1 Data Understanding\r\nThe data is available from Merchandise Trade by Region/Market and can be downloaded by clicking on the link ‘Download all in Excel’ on the same webpage. The file (outputFile.xlsx) consists of 3 sheets - Content, T1 which contains merchandise imports, and T2 which contains merchandise exports. The document includes merchandise trade information for more than one hundred countries and regions starting from Jan 1976 up to the present.\r\n\r\nFor this makeover, Japan, Hong Kong, Taiwan, United States, Malaysia, and Mainland China are the primary focus and the visualisation is limited to the period of Jan 2019 to Dec 2020.\r\nThe proposed data visualisation is relatively simple since it only consists of 2 charts – line charts for the total trade including import and export, and bar chart for the net trade. However, the current data source format is not readily available for analysis. The data is not organized into tidy rows and columns with proper field labels. Hence, additional effort is needed to transform the raw data into a tidy format that can be used to easily visualize the proposed alternative design.\r\n4.2 Data Preparation\r\nConnect the Excel file (outputFile.xlsx) to Tableau Prep Builder.\r\n\r\nDrag T1 sheet to start the data flow. Select the relevant Field Name which are ‘Subject: Merchandise Trade’ and ‘F518’ to ‘F541’.\r\n\r\nClick ‘Add a clean step’ hyperlink from the figure above. From the Clean 1, switch the display to ‘Show data grid’ to easily view the data.\r\nClick on the ellipsis of ‘Subject: Merchandise Trade’ column. Choose ‘Filter’ -> ‘Selected Values’.\r\n\r\nType, search and select individually the terms “Variables, Japan, Hong Kong, Taiwan, United States, Malaysia, and Mainland China”.\r\n\r\nRename the individual fields to “Country, 2019 Jan, 2019 Feb” until “… 2020 Dec”.\r\n\r\nRight click on the ‘Variables’ and select ‘Exclude’.\r\n\r\nOn the data flow diagram, choose the ‘+’ and select ‘Pivot’.\r\n\r\nFrom ‘Pivot 1’, drag all the renamed fields ‘2019 Jan’ until ‘2020 Dec’ to ‘Pivoted Fields’. The ‘Pivot Results’ should be like this:\r\n\r\nSelect the ellipsis on the ‘Country’ -> Split Values -> Custom Split and use the separator ‘(‘.\r\n\r\nRemove the original ‘Country’ field and rename the ‘Country – Split 1’ to ‘Country’, ‘Pivot1 Names’ to ‘Date’ and ‘Pivot1 Values’ to ‘Import Raw’.\r\n\r\nChange the data type of Date to ‘Date’ and ‘Import Raw’ to ‘# Number (whole).\r\n\r\nThe summary of changes for ‘Clean 1’ and ‘Pivot 1’ are as follows:\r\n\r\n\r\nRepeat steps 2-13 for T2 sheet. Note that for steps 11-12, it should be changed to ‘Export Raw’ instead of ‘Import Raw’. The results should be similar to this:\r\n\r\nOn the data flow diagram, drag Pivot 2 towards Pivot 1 and select Join\r\n\r\nApply the Join Settings where Pivot 1 Country = Pivot 2 Country; and Pivot 1 Date = Pivot 2 Date; Join Type: full.\r\n\r\nFrom the Join Results, remove ‘Country(Country -1)’ and ‘Date(Date-1) since these are redundant information.\r\n\r\nClick on the ellipsis of Export Raw -> Create Calculated Field -> Custom Calculation. Create a new field ‘Export’ by multiplying the Export Raw by 1000.\r\n\r\n\r\nSimilarly, click on the ellipsis of Import Raw -> Create Calculated Field -> Custom Calculation. Create a new filed ‘Import’ by multiplying the Import Raw by 1000.\r\n\r\nRemove ‘Export Raw’ and ‘Import Raw’ and rearrange the column to ‘Date, Country, Export, Import’.\r\n\r\nOn the data flow diagram, choose the ‘+’ after Join 1 and select ‘Output’.\r\n\r\nFrom Output, set the desired location and filename and click ‘Run Flow’ button to save the Tableau Data Extract (.hyper) output type.\r\n\r\nFinally, after completing all the steps for the data preparation, the final data flow should be similar to this:\r\n\r\nThrough data preparation, the raw data has been transformed into a tidy format with only 4 data fields namely Date, Country, Export, and Import which can be easily visualised using Tableau Desktop.\r\n4.3 Data Visualisation\r\nConnect the Tableau Data Extract output file (tidy_trade_data.hyper) from the data preparation steps to Tableau Desktop.\r\n\r\nAfter successful connection, the Data Source should be similar to this:\r\n\r\nOn Sheet 1 Data pane, right click on the ‘Export’ -> Create -> Calculated Field and create a new field ‘Total Trade’ using the formula [Export] + [Import].\r\n\r\n\r\nSimilarly, create a new field ‘Net Trade’ using the formula [Export] - [Import].\r\n\r\nFrom Data pane, drag ‘Country’ and ‘Date’ to Columns. Note that ‘Date’ should be in the ‘Month’ and ‘Continuous’ format.\r\n\r\nOn Data pane, change the date format to be consistent with the raw data source by selecting ‘Date’ -> Default Properties -> Date Format and typing ‘mmm yyyy’ in the Custom option.\r\n\r\n\r\nDrag ‘Total Trade’ and ‘Measure Values’ to Rows.\r\n\r\nRemove CNT(Extract), SUM(Net Trade) and SUM(Total Trade) from the Measure Values.\r\n\r\nFrom Measure Values on Rows, select Dual Axis.\r\n\r\nRight click from the secondary y-axis, select ‘Synchronize Axis’ and uncheck ‘Show Header’ to have only 1 visible synchronized y-axis.\r\n\r\nFrom the Marks pane, drag ‘Measure Name’ to ‘Color’ both for SUM(Total Trade) and Measure Values.\r\n\r\nChoose ‘Edit Colors’ from the ‘Measure Name’ color legends on the right side of the main workspace.\r\n\r\nSelect blue for Total Trade, green for Export and Red for Import.\r\n\r\nEdit the Legend Title from ‘Measure Names’ to ‘Legends:’ and rearrange it to Total Trade, Export, and finally Import.\r\n\r\nTo apply the concept of visual highlighting, in the Marks pane, adjust the Size of SUM(Total Trade) to a lower value as shown:\r\n\r\nSimilarly, adjust the ‘Measure Values’ Size to minimum and ‘Color’ Opacity to 80%.\r\n\r\nOn the main workspace, right click on the ‘Country’ and Hide Labels for Columns. Afterwards, right click on the x-axis, choose Edit Axis and remove the Title ‘Month of Date’.\r\n\r\nRight click on the y-axis, choose Edit Axis and update the Title to ‘Trade Value (S$)’.\r\n\r\nOn the Analytics pane, drag the ‘Trend Line’ to the main workspace and place it to SUM(Total Trade).\r\n\r\nRearrange the main workspace in ascending order of Total Trade by dragging the column header. The order of countries should be Japan, Hong Kong, Taiwan, United States, Malaysia, and Mainland China.\r\n\r\nAt this point, clarity of the line charts has been established. The succeeding steps will enhance the aesthetics by applying the concepts of data-ink.\r\nRight click on the country name and choose Format. Adjust the Default Font to size 10 and Shading to gray as shown below:\r\n\r\nRight click on the x-axis Dates and choose Format. Adjust the Default Shading to a lighter shade of gray as show below:\r\n\r\nRight click on the y-axis and choose Format. Adjust the Title Font size to 10.\r\n\r\nRight click on the main workspace, choose Format and then select Format Borders. To make trellis display per country move visible, adjust the Column Divider more as follows:\r\n\r\nTo make the Trade Value tick marks less prominent, adjust the Row Divider as follows:\r\n\r\nRename Sheet 1 to ‘Total Trade’. Copy and paste to a new sheet and rename it to ‘Net Trade’.\r\n\r\nIn the Net Trade sheet, remove the SUM(Trade Total) and Measure Values from Rows and drag Net Trade to replace it.\r\n\r\nFrom the Marks pane, change the chart type to Bar and drag ‘Net Trade’ to Color.\r\n\r\nFrom the SUM(Net Trade) legend, click Edit Colors. Adjust the Palette to red and green using the same color hex value of Import and Export chart line from Total Trade sheet. Set the Stepped Colors to 2 and set the Center to 0.\r\n\r\nThe bar chart of the Net Trade should be similar to this:\r\n\r\nFor both Total Trade and Net Trade sheets, adjust the view to ‘Entire View’.\r\n\r\nCreate a new dashboard with Fixed size A4 Landscape (1169 x 892). This size is chosen because the data visualisation must be in static form and therefore easier to print.\r\n\r\nDrag Vertical object to the main workspace.\r\n\r\nDrag ‘Text’ object and type the title of the graph with font size 14.\r\n\r\nDrag another Text object and type the subtitle of the graph with font Tableau Regular and font size 10.\r\n\r\nDrag Vertical object and place the ‘Total Trade’ sheet.\r\n\r\nThe sheet title ‘Total Trade’ is taking to much space. Right click on the title and select ‘Hide Title’. It will be replaced by Text object.\r\n\r\nDrag Vertical object and place the ‘Net Trade’ sheet.\r\n\r\nHide the Net Trade title and replace with Text object.\r\n\r\nAdjust the height of the Total Trade and Net Trade. Net Trade should be almost half of the Total Trade since its range is from -2B to 4B compared to 0B to 14B range of Total Trade.\r\n\r\nAdjust the background of Title and graph title to make it more visible.\r\n\r\n\r\nAdd a thin border to the graph and set the inner padding to 4.\r\n\r\nAdjust the y-axis title of Net Trade to ‘Net Trade (S$) and Net Trade Legends to ‘Net Trade: (-) Import (+) Export. Additionally, adjust the Total Trade legend title to ‘Trade Types:’\r\n\r\nRight click on the Total Trade and Net Trade graphs and add Area annotations to tell some interesting data stories.\r\n\r\nAdd the data source and write up blog hyperlinks by creating new calculated fields and new sheets ‘Source Link’ and ‘Web Link’. This reference provides detailed steps on how to create the hyperlinks in Tableau.\r\n\r\nFinally, add the data source and write up hyperlinks at the bottom of the dashboard.\r\n\r\n5.0 Derived Insights\r\n5.1 Total Trade Trends\r\nBased on the Total Trade linear trend, the trade with Japan is relatively consistent with minimal fluctuations. The total trades with United States and Malaysia are on downward trend. Nevertheless, the total trades with Hong Kong, Taiwan and Mainland China are on upward trend.\r\n5.2 Net Trade Insights\r\nBased on the Net Trade bar chart, Hong Kong is the top net exporter while Taiwan is the top net importer. Additionally, the value of exports exceeds imports for Singapore’s merchandise trade with Mainland China. The value of imports exceeds exports for Singapore’s trade with Japan, United States, and Malaysia. These observations were also verified by SingStat infographics.\r\n5.3 Significant Events\r\nBased on the line charts and bar graph, there are interesting data stories that maybe correlated to significant events of 2020 COVID-19 pandemic.\r\nTrade with Malaysia significantly dropped on Apr 2020 which coincided with the start of Singapore’s circuit breaker period.\r\nTrade with Mainland China significantly dropped on Feb 2020 around the same period when Chinese government imposed major restrictions.\r\nTrade with US reversed from net importer to net exporter on Apr 2020 around the period after WHO declared COVID-19 as global pandemic.\r\nMainland China become net exporter from Aug 2020 around the time when China’s economic recovery gained speed.\r\nNote though that these correlations with significant events do NOT imply causation on Singapore’s International Trade. There are many micro- and macro-economic factors that should be taken into consideration to fully understand the dynamics of international trades.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-05-30-dataviz-makeover-01/img/03_dashboard.png",
    "last_modified": "2021-05-30T18:45:25+08:00",
    "input_file": {},
    "preview_width": 1169,
    "preview_height": 827
  }
]
